backend: tensorflow
class_name: Model
config:
  input_layers:
  - [main_input, 0, 0]
  - [aux_input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 100]
      dtype: int32
      name: main_input
      sparse: false
    inbound_nodes: []
    name: main_input
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 100]
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config: {dtype: float32, maxval: 0.05, minval: -0.05, seed: null}
      embeddings_regularizer: null
      input_dim: 10000
      input_length: 100
      mask_zero: false
      name: embedding
      output_dim: 512
      trainable: true
    inbound_nodes:
    - - - main_input
        - 0
        - 0
        - {}
    name: embedding
  - class_name: CuDNNLSTM
    config:
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      go_backwards: false
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: cu_dnnlstm
      recurrent_constraint: null
      recurrent_initializer:
        class_name: Orthogonal
        config: {dtype: float32, gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 32
    inbound_nodes:
    - - - embedding
        - 0
        - 0
        - {}
    name: cu_dnnlstm
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 5]
      dtype: float32
      name: aux_input
      sparse: false
    inbound_nodes: []
    name: aux_input
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate, trainable: true}
    inbound_nodes:
    - - - cu_dnnlstm
        - 0
        - 0
        - &id001 {}
      - - aux_input
        - 0
        - 0
        - *id001
    name: concatenate
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - concatenate
        - 0
        - 0
        - {}
    name: dense
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dense
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: main_output
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: main_output
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: aux_output
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - cu_dnnlstm
        - 0
        - 0
        - {}
    name: aux_output
  name: model
  output_layers:
  - [main_output, 0, 0]
  - [aux_output, 0, 0]
keras_version: 2.2.4-tf